Консолидация/src/Documents/КорректировкиIFRS/КорректировкиIFRS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкиIFRS</name>
  <registerRecords>InformationRegister.Корректировки</registerRecords>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Аналитика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КорректировкиPL</name>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиPL</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Консолидация/src/Documents/КорректировкиIFRS/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьДанныеПериодов();

КонецПроцедуры

&НаКлиенте
Процедура КорректировкиPLПериодДействияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КорректировкиPL.ТекущиеДанные;
	ТекущиеДанные.ДатаНачала    = ТекущиеДанные.ПериодДействия.ДатаНачала;
	ТекущиеДанные.ДатаОкончания = ТекущиеДанные.ПериодДействия.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроверитьКорректностьЗаполненияПериодаДействия(Отказ);

КонецПроцедуры

#КонецОбласти

#Область Команды

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеПериодов()
	
	Для Каждого Стр Из Объект.КорректировкиPL Цикл
		
		Стр.Период = Новый СтандартныйПериод(Стр.ДатаНачала, Стр.ДатаОкончания);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьЗаполненияПериодаДействия(Отказ)
	
	ПустаяДата = Дата("00010101");
	
	Для Каждого Стр Из Объект.КорректировкиPL Цикл
		
		Если Стр.ДатаНачала = ПустаяДата ИЛИ Стр.ДатаОкончания = ПустаяДата Тогда
			Сообщить("Проверте корректность заполнения периода действия!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти
